x = float(input("Введіть координату x для точки A: "))
y = float(input("Введіть координату y для точки A: "))

if x > 0 and y > 0:
    print("Точка A знаходиться у першому квадранті.")
elif x < 0 and y > 0:
    print("Точка A знаходиться у другому квадранті.")
elif x < 0 and y < 0:
    print("Точка A знаходиться у третьому квадранті.")
elif x > 0 and y < 0:
    print("Точка A знаходиться у четвертому квадранті.")
elif x == 0 and y != 0:
    print("Точка A лежить на вісі Y.")
elif x != 0 and y == 0:
    print("Точка A лежить на вісі X.")
else:
    print("Точка A знаходиться в початку координат.")
